[
    {
        "title": "Two Forms of Pre-rendering",
        "date": "2022-01-01",
        "contentHtml": "<p>Next.js has two forms of pre-rendering: <strong>Static Generation</strong> and <strong>Server-side Rendering</strong>. The difference is in <strong>when</strong> it generates the HTML for a page.</p><ul><li><p><strong>Static Generation</strong> is the pre-rendering method that generates the HTML at <strong>build time</strong>. The pre-rendered HTML is then _reused_ on each request.</p></li><li><p><strong>Server-side Rendering</strong> is the pre-rendering method that generates the HTML on <strong>each request</strong>.</p></li></ul><p>Importantly, Next.js lets you <strong>choose</strong> which pre-rendering form to use for each page. You can create a \"hybrid\" Next.js app by using Static Generation for most pages and using Server-side Rendering for others.</p>",
        "id": 1
    },
    {
        "title": "When to Use Static Generation v.s. Server-side Rendering",
        "date": "2022-01-02",
        "contentHtml": "<p>We recommend using <strong>Static Generation</strong> (with and without data) whenever possible because your page can be built once and served by CDN, which makes it much faster than having a server render the page on every request.</p><p>You can use Static Generation for many types of pages, including:</p><ul><li><p>Marketing pages</p></li><li><p>Blog posts</p></li><li><p>E-commerce product listings</p></li><li><p>Help and documentation</p></li></ul><p>You should ask yourself: \"Can I pre-render this page <strong>ahead</strong> of a user's request?\" If the answer is yes, then you should choose Static Generation.</p><p>On the other hand, Static Generation is <strong>not</strong> a good idea if you cannot pre-render a page ahead of a user's request. Maybe your page shows frequently updated data, and the page content changes on every request.</p><p>In that case, you can use <strong>Server-Side Rendering</strong>. It will be slower, but the pre-rendered page will always be up-to-date. Or you can skip pre-rendering and use client-side JavaScript to populate data.</p>",
        "id": 2
    },
    {
        "title": "Ferry commuting",
        "date": "2025-09-21",
        "contentHtml": "<img src=\"https://www.goldengate.org/assets/1/6/larkspur.jpg\" alt=\"Larkspur ferry terminal\"><h2>Sail &amp; Rail combo ticket</h2><p>With Golden Gate Ferry and SMART, you can <a href=\"https://www.goldengate.org/ferry/sail-rail-explore/\">explore new places</a> while enjoying a comfortable ride and spectacular views across the Bay and through the rolling hills of Marin and Sonoma counties. Whether you're traveling with kids from San Francisco to family-friendly destinations in Marin and Sonoma, or leaving the suburbs for some adventure in San Francisco, the Sail & Rail combo is perfect for a fun day trip. Golden Gate Ferry and SMART offer convenient connection times in Larkspur making it easier than ever to leave the car behind and explore Sonoma, Marin, & San Francisco! Check schedules carefully. (Not valid for Oracle Park events.)</p><p>The <strong>$10 Sail &amp; rail ticket</strong> combines a one-way trip on both the Golden Gate ferry and the SMART train. This ticket is ideal for travel to and from San Francisco. The Sail and Rail combo ticket is <strong>only available for purchase using SMART e-Tickets app</strong>.</p><h2 id=\"larkspur-ferry\">Larkspur Ferry</h2><p><a href=\"https://www.goldengate.org/ferry/riding-the-ferry/terminal-locations-parking/\">Golden Gate Larkspur Ferry</a> operates service between Larkspur and San Francisco on weekdays, by three high-speed catamarans, and on weekends by a high-speed catamaran or 715-passenger Spaulding class vessel. The one-way trip takes 30 to 50 minutes depending on the vessel. This route offers spectacular views of the Golden Gate Bridge, Angel Island, Marin hill towns, and magnificent Mount Tamalpais. Larkspur Ferry docks at a terminal in central Marin County, just across the street from the Larkspur Landing Shopping Center (once the site of a quarry near San Quentin Prison). The Landing offers an array of unique shops, outdoor areas and restaurants.</p><p>Golden Gate Ferry operates daily service on three separate routes, with the exception of New Year's, Thanksgiving, and Christmas days when there is no service.</p><h2>Accessibility</h2><p>The Golden Gate Bridge, Highway and Transportation District is committed to ensuring that the District complies with all Federal Americans with Disabilities Act (ADA) regulations as well as the State of California accessibility requirements.</p><h2>Bikes on the ferry</h2><p>Bicycles, including electric bikes, are welcome aboard all Golden Gate Ferry (GGF) vessels with the understanding that customers may need to carry their bike up or down a flight of stairs to embark/disembark. Bikes are accepted on first-come, first-served basis. High-speed catamaran class vessels provide service on weekdays and a high-capacity Spaulding class vessel or a high-speed catamaran is used on weekends. Catamarans can accommodate up to 30 bikes; Spaulding vessels can accommodate up to 100 bikes.</p><h2>Ready to Ride?</h2><ul><li><a href=\"https://www.goldengate.org/ferry/route-schedule/larkspur-san-francisco/?backurl=%2Fferry%2Fschedules-maps%2F\">Schedules</a></li><li><a href=\"https://www.goldengate.org/sail--rail-10-fares/\">Fares</a></li><li><a href=\"https://www.goldengate.org/ferry/riding-the-ferry/tips-for-riding/\">Rider's Guide</a></li></ul>",
        "id": 3
    },
    {
        "title": "SMART commuting",
        "date": "2025-09-21",
        "contentHtml": "<img src=\"https://www.sonomamarintrain.org/sites/default/files/Images/DMU%2Bin%2Bthe%2BVineyard-magic-web2.jpg\" alt=\"SMART train crossing a vineyard\"><h2>About SMART</h2><p><a href=\"https://www.sonomamarintrain.org/\">Sonoma Marin Area Rail Tranist</a>is the North Bay’s passenger rail service providing a safe, reliable and congestion-free transportation option for Marin and Sonoma counties. The current 45-mile system includes stations in Windsor, the Sonoma County Airport area, Santa Rosa, Rohnert Park, Cotati, Petaluma, Novato, San Rafael, and Larkspur. SMART’s system also includes a <a href=\"https://www.sonomamarintrain.org/smart_pathway\">bicycle and pedestrian pathway</a> along the rail corridor.</p><p>Future extensions are planned for Healdsburg and Cloverdale. The full project will provide 70 miles of passenger rail service, connecting SMART passengers with jobs, education centers, retail hubs and housing along the Sonoma-Marin corridor, and a bicycle-pedestrian pathway.</p><h2>Accessibility</h2><p>SMART provides rail transit service that is accessible to passengers with disabilities. SMART’s platforms and trains are fully compliant with the Americans with Disabilities Act (ADA).</p><h2>Bikes on SMART</h2><p>Bikes are welcome on board SMART trains. Each two-car SMART train has spaces for up to 24 bikes. SMART stations also have bike storage including bike racks and secured bike lockers. Bike sharing is available near some SMART stations.</p><h2>Ready to ride?</h2><ul><li><a href=\"https://www.sonomamarintrain.org/schedules-fares\">Schedules</a></li><li><a href=\"https://www.sonomamarintrain.org/fares\">Fares</a></li><li><a href=\"https://www.sonomamarintrain.org/riders-guide\">Rider's Guide</a></li></ul>",
        "id": 4
    },
    {
        "title": "Sant Rosa, CA Taco Tuesday Ride",
        "date": "2025-09-21",
        "contentHtml": "<img src=\"https://raw.githubusercontent.com/nleal707/CS5513-Week05/refs/heads/master/public/images/srtt.jpg\" alt=\"Taco Tuesday Ride\"><p>Santa Rosa Taco Tuesday rides every Tuesday. Rain and holidays cancel. Check the <a href=\"https://www.facebook.com/groups/santarosatacotuesday/\">Facebook</a> page for notices of ride changes, themed rides and cancellations.</p><h2>Agenda</h2><ul><li><p><strong>5:30 PM</strong> Meet in the parking lot of 550 Silva Ave</p></li><li><p><strong>6:00 PM</strong> Pedals up!</p></li><li><p><strong>6:30 PM</strong> We take a 10-20 minute break at Courthouse Square (and take the official head count riding INTO the square). Here is an opportunity to join us for a late start.</p></li><li><p><strong>6:50 PM</strong> Depart Courthouse Square and ride to the food trucks at Mitote Food Park on Sebastopol Rd.</p></li><li><p><strong>7:10 PM</strong> <a href=\"http://www.mitotefoodpark.com/\">Mitote Food Park</a></p></li><li><p><strong>8:15 PM</strong> Pedals up at 8:15pm. Pedal to the JC neighborhood before splitting off. Some go to Yogurt Farms for dessert, some back to the parking lot.</p></li></ul><img src=\"https://raw.githubusercontent.com/nleal707/CS5513-Week04/refs/heads/master/public/images/bikeride.jpg\" alt=\"Taco Tuesday Ride\">",
        "id": 5
    }
]